[
    { "Q": "A former commandment is set aside because of what?", "A": " Its weakness and uselessness. (Heb 7:18)" }, { "Q": "A speechless donkey did what?", "A": " Spoke with a human voice and restrained the prophet’s madness. (2Pe 2:16)" }, { "Q": "All are what to the eyes of him to whom we must give account. A. Naked and exposed. (Heb 4:13)" }, { "Q": "All those who left Egypt led by Moses were those who what?", "A": " Heard and yet rebelled. (Heb 3:16)" }, { "Q": "Angels, though greater in what, do not pronounce a blasphemous judgment against them?", "A": " Might and power. (2Pe 2:11)" }, { "Q": "Another priest arises in the likeness of Melchidezek, who has become a priest how?", "A": " Not on the basis of a legal requirement concerning bodily descent, but by the power of an indestructible life. (Heb 7:16)" }, { "Q": "Anyone who has set aside the law of Moses dies without mercy on the evidence of how many witnesses?", "A": " Two or three. (Heb 10:28)" }, { "Q": "Arm yourselves with the same way of thinking, why?", "A": " Since Christ suffered in the flesh, for whoever has suffered in the flesh has ceased from sin. (1Pe 4:1)" }, { "Q": "Be all the more diligent to make what sure?", "A": " Your calling and election. (2Pe 1:10)" }, { "Q": "Be subject for the Lord’s sake to every human institution, whether it be to whom?", "A": " Whether it be to the emperor as supreme, or to governors as sent by him. (1Pe 2:14)" }, { "Q": "Be what for the sake of your prayers?", "A": " Self-controlled and sober-minded. (1Pe 4:7)" }, { "Q": "Behind the second curtain was a second section, having what?", "A": " The golden altar of incense and the ark of the covenant (covered on all sides with gold). (Heb 9:4)" }, { "Q": "Christ has entered into what?", "A": " Not into holy places made with hands, (which are copies of the true things,) but into heaven itself. (Heb 9:24)" }, { "Q": "Christ will appear a second time, why?", "A": " Not to deal with sin, but to save those who are eagerly waiting for him. (Heb 9:28)" }, { "Q": "Consider Jesus, the what of our confession?", "A": " The apostle and high priest. (Heb 3:1)" }, { "Q": "Consider him who endured from sinners such hostility against himself, so that you may not grow what?", "A": " Weary or fainthearted. (Heb 12:3)" }, { "Q": "Do not be led astray by what teachings?", "A": " Diverse and strange teachings. (Heb 13:9)" }, { "Q": "Do not harden your hearts, as when?", "A": " In the rebellion, on the day of testing in the wilderness. (Heb 3:8) (cf Heb 3:15; 4:7)" }, { "Q": "Do not overlook what one fact?", "A": " (This) That with the Lord one day is as a thousand years, and a thousand years as one day. (2Pe 3:8)" }, { "Q": "Do not regard lightly the discipline of the Lord, why?", "A": " For the Lord disciplines the one he loves, and chastises every son whom he receives. (Heb 12:5-6)" }, { "Q": "Do not repay what?", "A": " Repay evil for evil or reviling for reviling. (1Pe 3:9)" }, { "Q": "Elect exiles of the dispersion, for what?", "A": " For obedience to Jesus Christ and for sprinkling with his blood. (1Pe 1:1)" }, { "Q": "Especially those who what?", "A": " Indulge in the lust of defiling passion and despise authority. (2Pe 2:10)" }, { "Q": "Even if some do not obey the word, they may be won how?", "A": " Without a word by the conduct of their wives. (1Pe 3:1)" }, { "Q": "Even the first covenant had what?", "A": " Regulations for worship and an earthly place of holiness. (Heb 9:1)" }, { "Q": "Every high priest chosen from among men is appointed to offer what?", "A": " Gifts and sacrifices for sins. (Heb 5:1)" }, { "Q": "Every high priest chosen from among men is appointed to what?", "A": " To act on behalf of men in relation to God, to offer gifts and sacrifices for sins. (Heb 5:1)" }, { "Q": "Every high priest is appointed to offer what?", "A": " Both gifts and sacrifices. (Heb 8:3) (cf Heb 5:1)" }, { "Q": "Faith is the what?", "A": " The assurance of things hoped for, the conviction of things not seen. (Heb 11:1)" }, { "Q": "From one man were born descendants as many as what?", "A": " As many as the stars of heaven and as many as the innumerable grains of sand by the seashore. (Heb 11:12)" }, { "Q": "God did not spare angels when they sinned, but what?", "A": " Cast them into hell and committed them to chains of gloomy darkness to be kept until the judgment. (2Pe 2:4)" }, { "Q": "God has anointed you with the oil of gladness beyond your companions why?", "A": " You have loved righteousness and hated wickedness. (Heb 1:9)" }, { "Q": "God is not unjust so as to overlook what?", "A": " Your work and the love you have shown for his name in serving the saints. (Heb 6:10)" }, { "Q": "God will judge whom?", "A": " The sexually immoral and adulterous. (Heb 13:4)" }, { "Q": "God’s patience waited when?", "A": " In the days of Noah, while the ark was being prepared. (1Pe 3:20)" }, { "Q": "Governors are sent by him to what?", "A": " Punish those who do evil and to praise those who do good. (1Pe 2:14)" }, { "Q": "Grow in the what?", "A": " The grace and knowledge of our Lord and Savior Jesus Christ. (2Pe 3:18)" }, { "Q": "He can deal gently with whom?", "A": " The ignorant and wayward. (Heb 5:2)" }, { "Q": "He condemned what cities to extinction?", "A": " The cities of Sodom and Gomorrah. (2Pe 2:6)" }, { "Q": "He disciplines us why?", "A": " For our good, that we may share his holiness. (Heb 12:10) (cf Heb 12:6)" }, { "Q": "He entered once for all into the holy places, not by means of the blood of what?", "A": " Goats and calves. (Heb 9:12)" }, { "Q": "He had to be made like his brothers in every respect, why?", "A": " So that he might become a merciful and faithful high priest in the service of God, to make propitiation for the sins of the people. (Heb 2:17)" }, { "Q": "He has caused us to be born again to what?", "A": " A living hope (through the resurrection of Jesus Christ from the dead), to an inheritance (that is imperishable, undefiled, and unfading). (1Pe 1:3)" }, { "Q": "He has granted to us what promises?", "A": " His precious and very great promises. (2Pe 1:4)" }, { "Q": "He himself bore our sins how?", "A": " In his body on the tree. (1Pe 2:24)" }, { "Q": "He himself bore our sins, that we might what?", "A": " Die to sin and live to righteousness. (1Pe 2:24)" }, { "Q": "He might become a what in the service of God?", "A": " A merciful and faithful high priest. (Heb 2:17)" }, { "Q": "He opened what way for us through the curtain?", "A": " A new and living way. (Heb 10:20)" }, { "Q": "He received what from God the Father?", "A": " Honor and glory. (2Pe 1:17)" }, { "Q": "He was rejected when?", "A": " Afterward, when he [Esau] desired to inherit the blessing. (Heb 12:17)" }, { "Q": "He went to live in the land of promise, living in tents with whom?", "A": " Isaac and Jacob. (Heb 11:9)" }, { "Q": "His divine power has granted to us all things that pertain to life and godliness, through the knowledge of him who called us to his own what?", "A": " Glory and excellence. (2Pe 1:3)" }, { "Q": "His divine power has granted to us all things that pertain to what?", "A": " Life and godliness. (2Pe 1:3)" }, { "Q": "Husbands, live with your wives how?", "A": " In an understanding way, showing honor to the woman as the weaker vessel. (1Pe 3:7)" }, { "Q": "I am laying in Zion what?", "A": " A stone, a cornerstone chosen and precious. (1Pe 2:6)" }, { "Q": "I urge you as what to abstain from the passions of the flesh?", "A": " Sojourners and exiles. (1Pe 2:11)" }, { "Q": "I will establish a new covenant with whom?", "A": " With the house of Israel with and the house of Judah. (Heb 8:8)" }, { "Q": "I will never what?", "A": " Leave you nor forsake you. (Heb 13:5)" }, { "Q": "If anyone suffers as a Christian, let him what?", "A": " Let him not be ashamed, but let him glorify God in that name. (1Pe 4:16)" }, { "Q": "If it bears thorns and thistles, it is what?", "A": " Worthless and near to being cursed. (Heb 6:8)" }, { "Q": "If it bears what, it is worthless and near to being cursed?", "A": " Thorns and thistles. (Heb 6:8)" }, { "Q": "If the righteous is scarcely saved, what will become of whom?", "A": " The ungodly and the sinner? (1Pe 4:18)" }, { "Q": "If these qualities are what, they keep you from being ineffective?", "A": " If these qualities are yours and are increasing. (2Pe 1:8)" }, { "Q": "If these qualities are yours and are increasing, they keep you from being what?", "A": " Ineffective or unfruitful in the knowledge of our Lord Jesus Christ. (2Pe 1:8)" }, { "Q": "If you are insulted for the name of Christ, you are blessed, because who rests on you?", "A": " The Spirit of glory and of God. (1Pe 4:14)" }, { "Q": "If you are left without discipline, then you are what?", "A": " Illegitimate children and not sons. (Heb 12:8)" }, { "Q": "In the same way he sprinkled with the blood what?", "A": " Both the tent and all the vessels used in worship. (Heb 9:21)" }, { "Q": "In the wilderness, your fathers what?", "A": " Put me to the test, and saw my works for forty years. (Heb 3:8-10)" }, { "Q": "In your case, beloved, we feel sure of what?", "A": " Better things – things that belong to salvation. (Heb 6:9)" }, { "Q": "Into the second only the high priest goes, and not without taking blood, which he offers for whom?", "A": " For himself and for the unintentional sins of the people. (Heb 9:7)" }, { "Q": "Isaac invoked future blessings on whom?", "A": " Jacob and Esau. (Heb 11:20)" }, { "Q": "It is good for the heart to be strengthened how?", "A": " By grace, not by foods. (Heb 13:9)" }, { "Q": "It is impossible for the blood of what to take away sins?", "A": " Bulls and goats. (Heb 10:4)" }, { "Q": "It is impossible to restore them again to repentance why?", "A": " Since they are crucifying once again the Son of God to their own harm and holding him up to contempt. (Heb 6:4)" }, { "Q": "Jesus offered up prayers and supplications with what?", "A": " Loud cries and tears. (Heb 5:7)" }, { "Q": "Jesus offered up what?", "A": " Prayers and supplications. (Heb 5:7)" }, { "Q": "Joseph, at the end of his life, did what?", "A": " Made mention of the exodus of the Israelites and gave directions concerning his bones. (Heb 11:22)" }, { "Q": "Let them do this with what?", "A": " Joy and not with groaning. (Heb 13:17)" }, { "Q": "Let us consider how to stir up one another to love and good works how?", "A": " Not neglecting to meet together, (as is the habit of some,) but encouraging one another. (Heb 10:24-25)" }, { "Q": "Let us consider how to stir up one another to what?", "A": " Love and good works. (Heb 10:24)" }, { "Q": "Let us lay aside what?", "A": " Every weight, and sin which clings so closely. (Heb 12:1)" }, { "Q": "Let us offer to God acceptable worship, with what?", "A": " Reverence and awe. (Heb 12:28)" }, { "Q": "Let us then with confidence draw near to the throne of grace, why?", "A": " That we may receive mercy and find grace to help in time of need. (Heb 4:16)" }, { "Q": "Looking to Jesus, the what?", "A": " The founder and perfecter of our faith. (Heb 12:2)" }, { "Q": "Looking to Jesus, who what?", "A": " (For the joy that was set before him) Endured the cross (despising the shame,) and is seated at the right hand of the throne of God. (Heb 12:2)" }, { "Q": "Love one another how?", "A": " Earnestly from a pure heart. (1Pe 1:22) (cf 1Pe 4:8)" }, { "Q": "Make straight paths for your feet why?", "A": " So that what is lame may not be put out of joint but rather be healed. (Heb 12:13)" }, { "Q": "May grace and peace be multipled to you in the knowledge of whom?", "A": " Of God and of Jesus our Lord. (2Pe 1:2) (cf 1Pe 1:2)" }, { "Q": "May what be multiplied to you?", "A": " Grace and peace. (1Pe 1:2) (cf 2Pe 1:2)" }, { "Q": "May what be multiplied to you?", "A": " Grace and peace. (2Pe 1:2) (cf 1Pe 1:2)" }, { "Q": "Moses was hidden for three months by his parents, why?", "A": " Because they saw that the child was beautiful, and they were not afraid of the king’s edict. (Heb 11:23)" }, { "Q": "Not like the covenant I made with their fathers why?", "A": " For they did not continue in my covenant, and so I showed no concern for them. (Heb 8:9)" }, { "Q": "Once more I will shake what?", "A": " Not only the earth but also the heavens. (Heb 12:26)" }, { "Q": "Rejoice insofar as you share Christ’s sufferings, that you may also what?", "A": " Rejoice and be glad (when his glory is revealed). (1Pe 4:13)" }, { "Q": "Scoffers will come in the last days how?", "A": " With scoffing, following their own sinful desires. (2Pe 3:3)" }, { "Q": "See to it that no “root of bitterness” does what?", "A": " Springs up and causes trouble. (Heb 12:15)" }, { "Q": "See to it that no one is what like Esau?", "A": " Sexually immoral or unholy. (Heb 12:16)" }, { "Q": "Simon Peter was what?", "A": " A servant and apostle of Jesus Christ. (2Pe 1:1)" }, { "Q": "So that the Destroyer of the firstborn might not touch them, he what?", "A": " Kept the Passover and sprinkled the blood. (Heb 11:28)" }, { "Q": "Solid food is for whom?", "A": " The mature, for those who have their powers of discernment trained by constant practice to distinguish good from evil. (Heb 5:14)" }, { "Q": "Strive for what?", "A": " Peace with everyone, and for the holiness without which no one will see the Lord. (Heb 12:14)" }, { "Q": "Surely I will what?", "A": " Bless you and multiply you. (Heb 6:14)" }, { "Q": "Take care that you what?", "A": " Are not carried away with the error of lawless people and lose your own stability. (2Pe 3:17) (cf Heb 3:12)" }, { "Q": "The Lord is patient toward you, wishing what?", "A": " Not wishing that any should perish, but that all should reach repentance. (2Pe 3:9)" }, { "Q": "The Lord knows how to what?", "A": " To rescue the godly from trials and to keep the unrighteous under punishment until the day of judgment. (2Pe 2:9)" }, { "Q": "The Spirit of Christ in them predicted what?", "A": " The sufferings of Christ and the subsequent glories. (1Pe 1:11)" }, { "Q": "The children share in what?", "A": " Flesh and blood. (Heb 2:14)" }, { "Q": "The coming one will what?", "A": " Will come and will not delay. (Heb 10:37)" },{ "Q": "The gospel was preached even to those who are dead, that what?", "A": " Though judged in the flesh the way people are, they might live in the spirit the way God does. (1Pe 4:6)" }, { "Q": "The greater and more perfect tent is made how?", "A": " Not with hands, that is, not of this creation. (Heb 9:11)" }, { "Q": "The heavens and earth that now exist are stored up for fire, being kept until the day of what?", "A": " Judgment and destruction of the ungodly. (2Pe 3:7)" }, { "Q": "The heavens will be what?", "A": " Set on fire and dissolved. (2Pe 3:12)" }, { "Q": "The law has what?", "A": " (But) A shadow of the good things to come instead of the true form of these realities. (Heb 10:1)" }, { "Q": "The precious blood of Christ is like that of a lamb without what?", "A": " Blemish or spot. (1Pe 1:19)" }, { "Q": "The prophets searched and inquired carefully, inquiring what?", "A": " What person or time the Spirit of Christ in them was indicating. (1Pe 1:10-11)" }, { "Q": "The prophets who prophesied about the grace that was to be yours did what carefully?", "A": " Searched and inquired. (1Pe 1:10)" }, { "Q": "The word of God is discerning what?", "A": " The thoughts and intentions of the heart. (Heb 4:12)" }, { "Q": "The world of that time was what?", "A": " Deluged and destroyed. (2Pe 3:6)" }, { "Q": "There are some things in them that are hard to understand, which who twist to their own destruction?", "A": " The ignorant and unstable. (2Pe 3:16)" }, { "Q": "These all died in faith, having acknowledged that they were what?", "A": " Strangers and exiles on the earth. (Heb 11:13)" }, { "Q": "These, like irrational animals, creatures of instinct, are born to be what?", "A": " Caught and destroyed. (2Pe 2:12)" }, { "Q": "They desire a what?", "A": " A better country, that is, a heavenly one. (Heb 11:16)" }, { "Q": "They may be won without a word by the conduct of their wives, when they see what conduct?", "A": " Your respectful and pure conduct. (1Pe 3:1-2)" }, { "Q": "They serve a what of the heavenly things?", "A": " Copy and shadow. (Heb 8:5)" }, { "Q": "They shall not teach whom, saying, “Know the Lord”?", "A": " Each one his neighbor and each one his brother. (Heb 8:11)" }, { "Q": "They went about in skins of what?", "A": " Sheep and goats. (Heb 11:37)" }, { "Q": "They were serving whom?", "A": " Not themselves but you. (1Pe 1:12)" }, { "Q": "They will give account to him who is ready to judge whom?", "A": " The living and the dead. (1Pe 4:5)" }, { "Q": "This Melchizedek was what?", "A": " King of Salem, priest of the Most High God. (Heb 7:1)" }, { "Q": "This man who does not have his descent from them did what?", "A": " Received tithes from Abraham and blessed him who had the promises. (Heb 7:6)" }, { "Q": "Those descendants of Levi who receive the priestly office have a commandment in the law to take tithes from whom?", "A": " From the people, that is, from their brothers. (Heb 7:5)" }, { "Q": "Though you do not now see him, you what?", "A": " Believe in him and rejoice with joy that is inexpressible and filled with glory. (1Pe 1:8)" }, { "Q": "Through death he might what?", "A": " Destroy the one who has the power of death (that is, the devil), and deliver all those who through fear of death were subject to lifelong slavery. (Heb 2:14)" }, { "Q": "Tithes are received by whom?", "A": " (In the one case) by mortal men, (but in the other case) by one of whom it is testified that he lives. (Heb 7:8)" }, { "Q": "To him be the glory when?", "A": " Both now and to the day of eternity. (2Pe 3:18)" }, { "Q": "To him belong what forever and ever?", "A": " Glory and dominion. (1Pe 4:11) (cf 1Pe 5:11; 2Pe 3:18)" }, { "Q": "To which of the angels did God ever say what?", "A": " “You are my Son, today I have begotten you”? Or again, “I will be to him a father, and he shall be to me a son”? (Heb 1:5) (cf Heb 1:13)" }, { "Q": "We are his house, if indeed we hold fast to what?", "A": " Our confidence and our boasting in our hope. (Heb 3:6)" }, { "Q": "We are not of those who what?", "A": " Shrink back and are destroyed. (Heb 10:39)" }, { "Q": "We are of those who what?", "A": " Have faith and preserve their souls. (Heb 10:39)" }, { "Q": "We are waiting for what?", "A": " New heavens and a new earth (in which righteousness dwells). (2Pe 3:13)" }, { "Q": "We did not follow cleverly devised myths when we made known to you what?", "A": " The power and coming of our Lord Jesus Christ. (2Pe 1:16)" }, { "Q": "We do not have a high priest who is unable to sympathize with our weaknesses, but one who has been tempted how?", "A": " In every respect as we are (yet without sin). (Heb 4:15)" }, { "Q": "We have such a high priest, one who is a minster where?", "A": " In the holy places, in the true tent that the Lord set up, not man. (Heb 8:2)" }, { "Q": "We have such a high priest, one who is what?", "A": " Seated at the right hand of the throne of the Majesty in heaven, a minister in the holy places. (Heb 8:1)" }, { "Q": "We have this as a what anchor of the soul?", "A": " Sure and steadfast. (Heb 6:19)" }, { "Q": "We know him who said what?", "A": " “Vengeance is mine; I will repay.” And again, “The Lord will judge his people.” (Heb 10:30)" }, { "Q": "We made known to you what?", "A": " The power and coming of our Lord Jesus Christ. (2Pe 1:16)" }, { "Q": "We ourselves heard this voice borne from heaven when?", "A": " When he received honor and glory from God the Father, and the voice was borne to him by the Majestic Glory. (2Pe 1:18)" }, { "Q": "We see him crowned with what?", "A": " Glory and honor. (Heb 2:9)" }, { "Q": "What are being kept for the day of judgment?", "A": " The present heavens and earth. (2Pe 3:7)" }, { "Q": "What are offered that cannot perfect the conscience of the worshiper?", "A": " Gifts and sacrifices. (Heb 9:9)" }, { "Q": "What are stored up for fire?", "A": " The heavens and earth that now exist. (2Pe 3:7)" }, { "Q": "What credit is it if you endure when?", "A": " When you sin and are beaten for it? (1Pe 2:20)" }, { "Q": "What is appointed for man?", "A": " To die once, and after that comes judgment. (Heb 9:27)" }, { "Q": "What is not made with hands?", "A": " The greater and more perfect tent. (Heb 9:11)" }, { "Q": "What is not of this creation?", "A": " The greater and more perfect tent. (Heb 9:11)" }, { "Q": "What is ready to vanish away?", "A": " What is becoming obsolete and growing old. (Heb 8:13)" }, { "Q": "What received a just retribution?", "A": " Every transgression or disobedience. (Heb 2:2)" }, { "Q": "What receives the blessing of God?", "A": " Land that has drunk the rain that often falls on it, and produces a crop useful to those for whose sake it is cultivated. (Heb 6:7)" }, { "Q": "What sacrifices are pleasing to God?", "A": " (Such) To do good and to share what you have. (Heb 13:16)" }, { "Q": "What sort of people ought you to be in lives of what?", "A": " Holiness and godliness! (2Pe 3:11)" }, { "Q": "What spirit in God’s sight is very precious?", "A": " A gentle and quiet spirit. (1Pe 3:4)" }, { "Q": "What will be exposed?", "A": " The earth and the works that are done in it. (2Pe 3:10)" }, { "Q": "When they speak against you as evildoers, they may what?", "A": " See your good deeds and glorify God on the day of visitation. (1Pe 2:12)" }, { "Q": "Who all have one source?", "A": " He who sanctifies and those who are sanctified. (Heb 2:11)" }, { "Q": "Who sends you greetings?", "A": " She who is at Babylon, and Mark, my son. (1Pe 5:13) (cf Heb 13:24)" }, { "Q": "Who set up the true tent?", "A": " The Lord, not man. (Heb 8:2)" }, { "Q": "Who were heirs with him of the same promise?", "A": " Isaac and Jacob. (Heb 11:9)" }, { "Q": "Whoever desires what, let him keep his tongue from evil?", "A": " To love life and see good days. (1Pe 3:10)" }, { "Q": "Whoever has suffered in the flesh has ceased from sin, so as to live for the rest of the time in the flesh for what?", "A": " No longer for human passions but for the will of God. (1Pe 4:1-2)" }, { "Q": "Whoever would draw near to God must believe what?", "A": " That he exists and that he rewards those who seek him. (Heb 11:6)" }, { "Q": "With whom was he provoked for forty years?", "A": " (Was it not with) Those who sinned, whose bodies fell in the wilderness? (Heb 3:17)" }, { "Q": "Yet a little while, and the coming one will what?", "A": " Will come and will not delay. (Heb 10:37)" }, { "Q": "Yet do it with what, having a good conscience?", "A": " Gentleness and respect. (1Pe 3:15)" }, { "Q": "You are being built up as a spiritual house, why?", "A": " To be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ. (1Pe 2:5)" }, { "Q": "You are her children, if you what?", "A": " Do good and do not fear anything that is frightening. (1Pe 3:6)" }, { "Q": "You are waiting for what?", "A": " (These) New heavens and a new earth (in which righteousness dwells). (2Pe 3:14)" }, { "Q": "You believe in him and rejoice, obtaining what?", "A": " The outcome of your faith, the salvation of your souls. (1Pe 1:8-9)" }, { "Q": "You endured a hard struggle with sufferings, sometimes being publicly exposed to what?", "A": " Reproach and affliction. (Heb 10:33)" }, { "Q": "You endured a hard struggle with sufferings, sometimes being what?", "A": " Sometimes being publicly exposed to reproach and affliction, and sometimes being partners with those so treated. (Heb 10:33)" }, { "Q": "You have been born again of what seed?", "A": " Not of perishable seed but of imperishable. (1Pe 1:23)" }, { "Q": "You have been born again through what?", "A": " The living and abiding word of God. (1Pe 1:23)" }, { "Q": "You have crowned him with what?", "A": " Glory and honor. (Heb 2:7)" }, { "Q": "You have not desired what?", "A": " Sacrifices and offerings. (Heb 10:5) (cf Heb 10:8)" }, { "Q": "You have now returned to whom?", "A": " The Shepherd and Overseer of your souls. (1Pe 2:25)" }, { "Q": "You have taken no pleasure in what?", "A": " Burnt offerings and sin offerings. (Heb 10:6) (cf Heb 10:8)" }, { "Q": "You knew that you yourselves had what?", "A": " A better possession and an abiding one. (Heb 10:34)" }, { "Q": "You may be imitators of those who through what inherit the promises?", "A": " Faith and patience. (Heb 6:12)" }, { "Q": "You may proclaim the excellencies of him who called you how?", "A": " Out of darkness into his marvelous light. (1Pe 2:9)" }, { "Q": "You rejoice with joy that is what?", "A": " Inexpressible and filled with glory. (1Pe 1:8)" }, { "Q": "You should remember what?", "A": " The predictions of the holy prophets and the commandment of our Lord and Savior through your apostles. (2Pe 3:2)" }, { "Q": "You were ransomed from the futile ways inherited from your forefathers how?", "A": " Not with perishable things such as silver or gold, but with the precious blood of Christ. (1Pe 1:18-19)" }, { "Q": "You were ransomed from the futile ways inherited from your forefathers, not with perishable things such as what?", "A": " Silver or gold. (1Pe 1:18)" }, { "Q": "Your adversary the devil prowls around how?", "A": " Like a roaring lion, seeking someone to devour. (1Pe 5:8)" }, { "Q": "Your what are in God?", "A": " Faith and hope. (1Pe 1:21)" }]