[ { "Q": " A living Stone how?", "A": " Rejected by men but in the sight of God chosen and precious. (1Pe 2:4)" }, { "Q": " Baptism now saves you also, how?", "A": " Not as a removal of dirt from the body but as an appeal to God for a good conscience, through the resurrection of Jesus Christ. (1Pe 3:21)" }, { "Q": " Be diligent to be found by him how?", "A": " Without spot or blemish, and at peace. (2Pe 3:14)" }, { "Q": " By Silvanus I have written how to you?", "A": " Briefly, exhorting and declaring that this is the true grace of God. (1Pe 5:12)" }, { "Q": " Do not let your adorning be external, how?", "A": " The braiding of hair and the putting on of gold jewelry, or the clothing you wear. (1Pe 3:3)" }, { "Q": " Do what so that what is lame may not be put out of joint but rather be healed?", "A": " Lift your drooping hands and strengthen your weak knees, and make straight paths for your feet. (Heb 12:12-13)" }, { "Q": " He entered once for all into the holy places, by what means?", "A": " Not by means of the blood of goats and calves but by means of his own blood. (Heb 9:12)" }, { "Q": " He has no need to offer sacrifices how?", "A": " Daily, first for his own sins and then for the sins of the people. (Heb 7:27)" }, { "Q": " How much worse punishment will be deserved by the one who has what?", "A": " Has trampled underfoot the Son of God, and has profaned the blood of the covenant by which he was sanctified, and has outraged the Spirit of grace? (Heb 10:29)" }, { "Q": " I exhort the elders among you, as a what?", "A": " A fellow elder and a witness of the sufferings of Christ, as well as a partaker in the glory that is going to be revealed. (1Pe 5:1)" }, { "Q": " If we go on sinning deliberately after receiving the knowledge of the truth, what remains?", "A": " There no longer remains a sacrifice for sins, but a fearful expectation of judgment, and a fury of fire that will consume the adversaries. (Heb 10:26)" }, { "Q": " In the ark of the covenant was what?", "A": " The golden urn holding the manna, and Aaron’s staff that budded, and the tablets of the covenant. (Heb 9:4)" }, { "Q": " In the first section were what?", "A": " The lampstand and the table and the bread of the Presence. (Heb 9:2)" }, { "Q": " Jesus Christ is at the right hand of God, with whom having been subjected to him?", "A": " Angels, authorities, and powers. (1Pe 3:22)" }, { "Q": " Jesus Christ is the same when?", "A": " Yesterday and today and forever. (Heb 13:8)" }, { "Q": " Long ago God spoke to our fathers how?", "A": " At many times and in many ways, by the prophets. (Heb 1:1)" }, { "Q": " See to it that what?", "A": " That no one fails to obtain the grace of God; that no 'root of bitterness' springs up and causes trouble, and by it many become defiled; that no one is sexually immoral or unholy like Esau (who sold his birthright for a single meal)"}, { "Q": " Since we are surrounded by so great a cloud of witnesses, let us what?", "A": " (Also) Lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us. (Heb 12:1)" }, { "Q": " The earth was formed how?", "A": " Out of water and by water by the word of God. (2Pe 3:5)" }, { "Q": " The sprinkling of defiled persons with what sanctifies for the purification of the flesh?", "A": " With the blood of goats and bulls and with the ashes of a heifer. (Heb 9:13)" }, { "Q": " The stone that the builders rejected has become what?", "A": " The cornerstone, and a stone of stumbling and a rock of offense. (1Pe 2:7-8)" }, { "Q": " The tested genuineness of your faith may be found to result in what at the revelation of Jesus Christ?", "A": " Praise and glory and honor. (1Pe 1:7)" }, { "Q": " They deliberately overlook what fact?", "A": " (This) That the heavens existed long ago, and the earth was formed out of water and through water by the word of God, and that by means of these the world that then existed was deluged with water and perished. (2Pe 3:5)" }, { "Q": " They formerly did not obey when?", "A": " When God’s patience waited in the days of Noah, while the ark was being prepared. (1Pe 3:20)" }, { "Q": " We have confidence to enter the holy places how?", "A": " By the blood of Jesus, by a new and living way opened for us through the curtain (that is, through his flesh) (Heb 10:19)"}, { "Q": " What if it bears thorns and thistles?", "A": " It is worthless and near to being cursed, and its end is to be burned. (Heb 6:8)" }, { "Q": " You have been born again how?", "A": " Not of perishable seed, but of imperishable through the living and abiding word of God. (1Pe 1:23)"} ]