[
    {"Q": " Gifts and sacrifices are offered that deal only with what?",
    "A": " Food and drink and various washings, regulations for the body imposed until the time of reformation. (Heb 9:10)"
    },
    {"Q": " God also bore witness by what?",
    "A": " Signs and wonders and various miracles and by gifts of the Holy Spirit (distributed according to his will). (Heb 2:4)"
    },
    {"Q": " He has caused us to be born again to an inheritance that is what?",
    "A": " Imperishable, undefiled, and unfading, kept in heaven for you. (1Pe 1:4)"
    },
    {"Q": " Let none of you suffer as a what?",
    "A": " As a murderer or a thief or an evildoer or as a meddler. (1Pe 4:15)"
    },
    {"Q": " Let us draw near how?",
    "A": " With a true heart in full assurance of faith, with our hearts sprinkled clean from an evil conscience and our bodies washed with pure water. (Heb 10:22)" 
    },
    {"Q": " Others suffered what?",
    "A": " Mocking and flogging, and even chains and     imprisonment. (Heb 11:36)"
    },
    {"Q": " The God of all grace will himself what?",
    "A": " Restore, confirm, strengthen, and establish you. (1Pe 5:10)"
    },
    {"Q": " The word of God is piercing to the division of what?",
    "A": " Of soul and of spirit, of joints and of marrow. (Heb 4:12)"
    },
    {"Q": " They went about, wandering about where?",
    "A": " In deserts and mountains, and in dens and caves of the earth. (Heb 11:38)"
    },
    {"Q": " What are offered according to the law?",
    "A": " (These) Sacrifices and offerings and burnt offerings and sin offerings. (Heb 10:8) (cf Heb 8:4)"
    },
    {"Q": " You are a what, that you may proclaim the excellencies of him who called you?",
    "A": " A chosen race, a royal priesthood, a holy nation, a people for his own possession. (1Pe 2:9)"
    },
    {"Q": " You have neither desired nor taken pleasure in what?",
    "A": " Sacrifices and offerings and burnt offerings and sin offerings. (Heb 10:8) (cf Heb 10:6)"
    }
]