[
    { "Q":"For it was indeed ", "A": "fitting that we should have such a high priest, holy, innocent, unstained, separated from sinners, and exalted above the heavens. Heb 7:26"},
    { "Q":"He has ", "A": "no need, like those high priests, to offer sacrifices daily, first for his own sins and then for those of the people, since he did this once for all when he offered up himself. Heb 7:27"},
    { "Q":"But when Christ appeared ", "A": "as a high priest of the good things that have come, then through the greater and more perfect tent (not made with hands, that is, not of this creation) he entered once for all into the holy places, not by means of the blood of goats and calves but by means of his own blood, thus securing an eternal redemption. Heb 9:11-12"},
    { "Q":"Indeed, ", "A": "under the law almost everything is purified with blood, and without the shedding of blood there is no forgiveness of sins. Heb 9:22"},
    { "Q":"For Christ ", "A": "has entered, not into holy places made with hands, which are copies of the true things, but into heaven itself, now to appear in the presence of God on our behalf. Heb 9:24"},
    { "Q":"And just ", "A": "as it is appointed for man to die once, and after that comes judgment, so Christ, having been offered once to bear the sins of many, will appear a second time, not to deal with sin but to save those who are eagerly waiting for him. Heb 9:27-28"},
    { "Q":"For since ", "A": "the law has but a shadow of the good things to come instead of the true form of these realities, it can never, by the same sacrifices that are continually offered every year, make perfect those who draw near. Heb 10:1"},
    { "Q":"Let us hold ", "A": "fast the confession of our hope without wavering, for he who promised is faithful. Heb 10:23"},
    { "Q":"And let ", "A": "us consider how to stir up one another to love and good works, not neglecting to meet together, as is the habit of some, but encouraging one another, and all the more as you see the Day drawing near. Heb 10:24-25"},
    { "Q":"For if we ", "A": "go on sinning deliberately after receiving the knowledge of the truth, there no longer remains a sacrifice for sins, but a fearful expectation of judgment, and a fury of fire that will consume the adversaries. Heb 10:26-27"},
    { "Q":"Now faith ", "A": "is the assurance of things hoped for, the conviction of things not seen. Heb 11:1"},
    { "Q":"By ", "A": "faith we understand that the universe was created by the word of God, so that what is seen was not made out of things that are visible. Heb 11:3"},
    { "Q":"And without ", "A": "faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him. Heb 11:6"},
    { "Q":"Therefore, since ", "A": "we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfecter of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God. Heb 12:1-2"},
    { "Q":"And have ", "A": "you forgotten the exhortation that addresses you as sons? My son, do not regard lightly the discipline of the Lord, nor be weary when reproved by him. For the Lord disciplines the one he loves, and chastises every son whom he receives. Heb 12:5-6"},
    { "Q":"For the moment ", "A": "all discipline seems painful rather than pleasant, but later it yields the peaceful fruit of righteousness to those who have been trained by it. Heb 12:11"},
    { "Q":"Strive ", "A": "for peace with everyone, and for the holiness without which no one will see the Lord. Heb 12:14"},
    { "Q":"Therefore let us be ", "A": "grateful for receiving a kingdom that cannot be shaken, and thus let us offer to God acceptable worship, with reverence and awe, for our God is a consuming fire. Heb 12:28-29"},
    { "Q":"Let brotherly ", "A": "love continue. Do not neglect to show hospitality to strangers, for thereby some have entertained angels unawares. Heb 13:1-2"},
    { "Q":"Jesus ", "A": "Christ is the same yesterday and today and forever. Heb 13:8"},
    { "Q":"Do not be ", "A": "led away by diverse and strange teachings, for it is good for the heart to be strengthened by grace, not by foods, which have not benefited those devoted to them. Heb 13:9"},
    { "Q":"Therefore let us go ", "A": "to him outside the camp and bear the reproach he endured. For here we have no lasting city, but we seek the city that is to come. Heb 13:13-14"},
    { "Q":"Do not neglect ", "A": "to do good and to share what you have, for such sacrifices are pleasing to God. Heb 13:16"},
    { "Q":"Obey ", "A": "your leaders and submit to them, for they are keeping watch over your souls, as those who will have to give an account. Let them do this with joy and not with groaning, for that would be of no advantage to you. Heb 13:17"},
    { "Q":"Blessed ", "A": "be the God and Father of our Lord Jesus Christ! According to his great mercy, he has caused us to be born again to a living hope through the resurrection of Jesus Christ from the dead, to an inheritance that is imperishable, undefiled, and unfading, kept in heaven for you. 1Pe 1:3-4"},
    { "Q":"Though ", "A": "you have not seen him, you love him. Though you do not now see him, you believe in him and rejoice with joy that is inexpressible and filled with glory, obtaining the outcome of your faith, the salvation of your souls. 1Pe 1:8-9"},
    { "Q":"Therefore, preparing ", "A": "your minds for action, and being sober-minded, set your hope fully on the grace that will be brought to you at the revelation of Jesus Christ. 1Pe 1:13"},
    { "Q":"He was ", "A": "foreknown before the foundation of the world but was made manifest in the last times for the sake of you who through him are believers in God, who raised him from the dead and gave him glory, so that your faith and hope are in God. 1Pe 1:20-21"},
    { "Q":"So put ", "A": "away all malice and all deceit and hypocrisy and envy and all slander. 1Pe 2:1"},
    { "Q":"Like ", "A": "newborn infants, long for the pure spiritual milk, that by it you may grow up into salvation-- if indeed you have tasted that the Lord is good. 1Pe 2:2-3"},
    { "Q":"For it stands ", "A": "in Scripture: Behold, I am laying in Zion a stone, a cornerstone chosen and precious, and whoever believes in him will not be put to shame. 1Pe 2:6"},
    { "Q":"Keep your conduct ", "A": "among the Gentiles honorable, so that when they speak against you as evildoers, they may see your good deeds and glorify God on the day of visitation. 1Pe 2:12"},
    { "Q":"For this is the will ", "A": "of God, that by doing good you should put to silence the ignorance of foolish people. 1Pe 2:15"},
    { "Q":"Honor ", "A": "everyone. Love the brotherhood. Fear God. Honor the emperor. 1Pe 2:17"},
    { "Q":"He himself ", "A": "bore our sins in his body on the tree, that we might die to sin and live to righteousness. By his wounds you have been healed. 1Pe 2:24"},
    { "Q":"Finally, ", "A": "all of you, have unity of mind, sympathy, brotherly love, a tender heart, and a humble mind. 1Pe 3:8"},
    { "Q":"Do not repay ", "A": "evil for evil or reviling for reviling, but on the contrary, bless, for to this you were called, that you may obtain a blessing. 1Pe 3:9"},
    { "Q":"But in ", "A": "your hearts honor Christ the Lord as holy, always being prepared to make a defense to anyone who asks you for a reason for the hope that is in you; yet do it with gentleness and respect, having a good conscience, so that, when you are slandered, those who revile your good behavior in Christ may be put to shame. 1Pe 3:15-16"},
    { "Q":"For it is better ", "A": "to suffer for doing good, if that should be God's will, than for doing evil. 1Pe 3:17"},
    { "Q":"The end ", "A": "of all things is at hand; therefore be self-controlled and sober-minded for the sake of your prayers. 1Pe 4:7"},
    { "Q":"Above ", "A": "all, keep loving one another earnestly, since love covers a multitude of sins. 1Pe 4:8"},
    { "Q":"Beloved, ", "A": "do not be surprised at the fiery trial when it comes upon you to test you, as though something strange were happening to you. But rejoice insofar as you share Christ's sufferings, that you may also rejoice and be glad when his glory is revealed. 1Pe 4:12-13"},
    { "Q":"Likewise, ", "A": "you who are younger, be subject to the elders. Clothe yourselves, all of you, with humility toward one another, for 'God opposes the proud but gives grace to the humble.' 1Pe 5:5"},
    { "Q":"Be ", "A": "sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion, seeking someone to devour. 1Pe 5:8"},
    { "Q":"And after ", "A": "you have suffered a little while, the God of all grace, who has called you to his eternal glory in Christ, will himself restore, confirm, strengthen, and establish you. 1Pe 5:10"},
    { "Q":"His ", "A": "divine power has granted to us all things that pertain to life and godliness, through the knowledge of him who called us to his own glory and excellence, by which he has granted to us his precious and very great promises, so that through them you may become partakers of the divine nature, having escaped from the corruption that is in the world because of sinful desire. 2Pe 1:3-4"},
    { "Q":"Therefore, brothers, ", "A": "be all the more diligent to confirm your calling and election, for if you practice these qualities you will never fall. 2Pe 1:10"},
    { "Q":"For no ", "A": "prophecy was ever produced by the will of man, but men spoke from God as they were carried along by the Holy Spirit. 2Pe 1:21"},
    { "Q":"But false ", "A": "prophets also arose among the people, just as there will be false teachers among you, who will secretly bring in destructive heresies, even denying the Master who bought them, bringing upon themselves swift destruction. 2Pe 2:1"},
    { "Q":"The Lord ", "A": "is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance. 2Pe 3:9"},
    { "Q":"But the ", "A": "day of the Lord will come like a thief, and then the heavens will pass away with a roar, and the heavenly bodies will be burned up and dissolved, and the earth and the works that are done on it will be exposed. 2Pe 3:10"},
    { "Q":"But according ", "A": "to his promise we are waiting for new heavens and a new earth in which righteousness dwells. 2Pe 3:13"},
    { "Q":"And to ", "A": "which of the angels has he ever said, Sit at my right hand until I make your enemies a footstool for your feet? Heb 1:13"},
    { "Q":"But we ", "A": "see him who for a little while was made lower than the angels, namely Jesus, crowned with glory and honor because of the suffering of death, so that by the grace of God he might taste death for everyone. Heb 2:9"},
    { "Q":"For it was fitting ", "A": "that he, for whom and by whom all things exist, in bringing many sons to glory, should make the founder of their salvation perfect through suffering. Heb 2:10"},
    { "Q":"So then, ", "A": "there remains a Sabbath rest for the people of God, for whoever has entered God's rest has also rested from his works as God did from his. Heb 4:9-10"},
    { "Q":"Since then ", "A": "we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast our confession. Heb 4:14"},
    { "Q":"Consequently, ", "A": "he is able to save to the uttermost those who draw near to God through him, since he always lives to make intercession for them. Heb 7:25"},
    { "Q":"Now the ", "A": "point in what we are saying is this: we have such a high priest, one who is seated at the right hand of the throne of the Majesty in heaven, a minister in the holy places, in the true tent that the Lord set up, not man. Heb 8:1-2"},
    { "Q":"Therefore he ", "A": "is the mediator of a new covenant, so that those who are called may receive the promised eternal inheritance, since a death has occurred that redeems them from the transgressions committed under the first covenant. Heb 9:15"},
    { "Q":"But when Christ had ", "A": "offered for all time a single sacrifice for sins, he sat down at the right hand of God, waiting from that time until his enemies should be made a footstool for his feet. Heb 10:12-13"},
    { "Q":"Keep your life ", "A": "free from love of money, and be content with what you have, for he has said, 'I will never leave you nor forsake you.' So we can confidently say, 'The Lord is my helper; I will not fear; what can man do to me?' Heb 13:5-6"},
    { "Q":"As you ", "A": "come to him, a living stone rejected by men but in the sight of God chosen and precious, you yourselves like living stones are being built up as a spiritual house, to be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ. 1Pe 2:4-5"},
    { "Q":"For to this ", "A": "you have been called, because Christ also suffered for you, leaving you an example, so that you might follow in his steps. 1Pe 2:21"},
    { "Q":"Humble ", "A": "yourselves, therefore, under the mighty hand of God so that at the proper time he may exalt you, casting all your anxieties on him, because he cares for you. 1Pe 5:6-7"},
    { "Q":"But grow ", "A": "in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory both now and to the day of eternity. Amen. 2Pe 3:18"},
    { "Q":"And we ", "A": "desire each one of you to show the same earnestness to have the full assurance of hope until the end, so that you may not be sluggish, but imitators of those who through faith and patience inherit the promises. Heb 6:11-12"},
    { "Q":"For on ", "A": "the one hand, a former commandment is set aside because of its weakness and uselessness (for the law made nothing perfect); but on the other hand, a better hope is introduced, through which we draw near to God. Heb 7:18-19"},
    { "Q":"For if the ", "A": "blood of goats and bulls, and the sprinkling of defiled persons with the ashes of a heifer, sanctify for the purification of the flesh, how much more will the blood of Christ, who through the eternal Spirit offered himself without blemish to God, purify our conscience from dead works to serve the living God. Heb 9:13-14"},
    { "Q":"As obedient ", "A": "children, do not be conformed to the passions of your former ignorance, but as he who called you is holy, you also be holy in all your conduct, since it is written, 'You shall be holy, for I am holy.' 1Pe 1:14-16"},
    { "Q":"So also ", "A": "Christ did not exalt himself to be made a high priest, but was appointed by him who said to him, 'You are my Son, today I have begotten you.' Heb 5:5"},
    { "Q":"But exhort ", "A": "one another every day, as long as it is called 'today,' that none of you may be hardened by the deceitfulness of sin. Heb 3:13"},
    { "Q":"Let us then ", "A": "with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need. Heb 4:16"},
    { "Q":"But do ", "A": "not overlook this one fact, beloved, that with the Lord one day is as a thousand years, and a thousand years as one day. 2Pe 3:8"},
    { "Q":"But of ", "A": "the Son he says, 'Your throne, O God, is forever and ever, the scepter of uprightness is the scepter of your kingdom. You have loved righteousness and hated wickedness; therefore God, your God, has anointed you with the oil of gladness beyond your companions.' Heb 1:8-9"},
    { "Q":"For Jesus ", "A": "has been counted worthy of more glory than Moses - as much more glory as the builder of a house has more honor than the house itself. Heb 3:3"},
    { "Q":"In the ", "A": "days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to him who was able to save him from death, and he was heard because of his reverence. Heb 5:7"},
    { "Q":"And being ", "A": "made perfect, he became the source of eternal salvation to all who obey him, being designated by God a high priest after the order of Melchizedek. Heb 5:9-10"},
    { "Q":"For when God ", "A": "made a promise to Abraham, since he had no one greater by whom to swear, he swore by himself, saying, 'Surely I will bless you and multiply you.' Heb 6:13-14"},
    { "Q":"But as ", "A": "it is, Christ has obtained a ministry that is as much more excellent than the old as the covenant he mediates is better, since it is enacted on better promises. Heb 8:6"},
    { "Q":"For this is the covenant ", "A": "that I will make with the house of Israel after those days, declares the Lord: I will put my laws into their minds, and write them on their hearts, and I will be their God, and they shall be my people. Heb 8:10"},
    { "Q":"For I ", "A": "will be merciful toward their iniquities, and I will remember their sins no more. Heb 8:12"},
    { "Q":"In speaking ", "A": "of a new covenant, he makes the first one obsolete. And what is becoming obsolete and growing old is ready to vanish away. Heb 8:13"},
    { "Q":"For it is impossible ", "A": "for the blood of bulls and goats to take away sins. Heb 10:4"},
    { "Q":"For by ", "A": "a single offering he has perfected for all time those who are being sanctified. Heb 10:14"},
    { "Q":"It ", "A": "is a fearful thing to fall into the hands of the living God. Heb 10:31"},
    { "Q":"He considered ", "A": "the reproach of Christ greater wealth than the treasures of Egypt, for he was looking to the reward. Heb 11:26"},
    { "Q":"But you ", "A": "are a chosen race, a royal priesthood, a holy nation, a people for his own possession, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light. 1Pe 2:9"},
    { "Q":"For we did ", "A": "not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of his majesty. 2Pe 1:16"},
    { "Q":"For when he ", "A": "received honor and glory from God the Father, and the voice was borne to him by the Majestic Glory, 'This is my beloved Son, with whom I am well pleased,' we ourselves heard this very voice borne from heaven, for we were with him on the holy mountain. 2Pe 1:17-18"},
    { "Q":"For it would ", "A": "have been better for them never to have known the way of righteousness than after knowing it to turn back from the holy commandment delivered to them. 2Pe 2:21"},
    { "Q":"But by ", "A": "the same word the heavens and earth that now exist are stored up for fire, being kept until the day of judgment and destruction of the ungodly. 2Pe 3:7"},
    { "Q":"For God ", "A": "is not unjust so as to overlook your work and the love that you have shown for his name in serving the saints, as you still do. Heb 6:10"}
]