[
{
"Q": " It is impossible, in the case of whom, to restore them again to repentance?",
"A": "Those who have once been enlightened, who have tasted the heavenly gift, and have shared in the Holy Spirit, and have tasted the goodness of the word of God and the powers of the age to come, and then have fallen away. (Heb 6:4-6)"
},
{
"Q": " Let us go on to maturity, not laying again a foundation of what?",
"A": "Repentance from dead works and of faith toward God, and of instruction about washings, the laying on of hands, the resurrection of the dead, and eternal judgment. (Heb 6:1-2)"
},
{
"Q": " Make every effort to supplement what?",
"A": "Your faith with virtue, and virtue with knowledge, and knowledge with self-control, and self-control with steadfastness, and steadfastness with godliness, and godliness with brotherly affection, and brotherly affection with love. (2Pe 1:5)"
},
{
"Q": " Shepherd the flock of God that is among you how?",
"A": "Exercising oversight, not under compulsion, but willingly, as God would have you; not for shameful gain, but eagerly; not domineering over those in your charge, but being examples to the flock. (1Pe 5:2-3)"
},
{
"Q": " The Gentiles what to do what?",
"A": "Living in sensuality, passions, drunkenness, orgies, drinking parties, and lawless idolatry. (1Pe 4:3)"
},
{
"Q": " The time that is past suffices for doing what?",
"A": "What the Gentiles want to do, living in sensuality, passions, drunkenness, orgies, drinking parties, and lawless idolatry. (1Pe 4:3)"
},
{
"Q": " The word of God is what?",
"A": "Living and active, sharper than any two-edged sword, piercing to the division of soul and of spirit, of joints and of marrow, and discerning the thoughts and intentions of the heart. (Heb 4:12)"
},
{
"Q": " They went about how?",
"A": "In skins of sheep and goats, destitute, afflicted, mistreated (of whom the world was not worthy) wandering about in deserts and mountains, and in dens and caves of the earth. (Heb 11:37-38)"
},
{
"Q": " Time would fail me to tell of those who through faith did what?",
"A": "Conquered kingdoms, enforced justice, obtained promises, stopped the mouths of lions, quenched the power of fire, escaped the edge of the sword, were made strong out of weakness, became mighty in war, put foreign armies to flight. (Heb 11:32-34)"
},
{
"Q": " Time would fail me to tell of whom?",
"A": "Gideon, Barak, Samson, Jephthah, of David and Samuel and the prophets. (Heb 11:32)"
},
{
"Q": " Whoever desires to love life and see good days, let him what?",
"A": "Let him keep his tongue from evil and his lips from speaking deceit; let him turn away from evil and do good; let him seek peace and pursue it. (1Pe 3:10)"
},
{
"Q": " You have come to what?",
"A": "To Mount Zion and to the city of the living God, the heavenly Jerusalem, and to innumerable angels in festal gathering, and to the assembly of the firstborn who are enrolled in heaven, and to God, the judge of all, and to the spirits of the righteous made perfect, and to Jesus, the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel. (Heb 12:22-24)"
},
{
"Q": " You have not come to what?", 
"A": "What may be touched, a blazing fire and darkness and gloom and a tempest and the sound of a trumpet and a voice whose words made the hearers beg that no further messages be spoken to them. (Heb 12:18)"
}
]