[
{"Q": "Who said it, to whom? You are my Son, today I have begotten you.", "A": "God said it, not to angels, but to the Son [Jesus]. Heb 1:5"},
{"Q": "Who says it, and when? Let all God's angels worship him.", "A": "(He) God says it, when he brings the firstborn into the world. Heb 1:6"},
{"Q": "Who says it, of whom? He makes his angels winds, and his minsters a flame of fire.", "A": "(He) God says it, of the angels. Heb 1:7"},
{"Q": "Who said it, to whom? Sit at my right hand until I make your enemies a footstool for your feet.", "A": "God said it, not to the angels. Heb 1:13"},
{"Q": "Who says it? Today, if you hear his voice, do not harden your hearts as in the rebellion.", "A": "The Holy Spirit. Heb 3:7"},
{"Q": "Who said it, about whom? They always go astray in their heart; they have not known my ways.", "A": "(I) God said it, about that generation (your fathers). Heb 3:9"},
{"Q": "Who has said it? As I swore in my wrath, `They shall not enter my rest.'", "A": "(He) God. Heb 4:3"},
{"Q": "Who has said it, and where? And God rested on the seventh day from all his works.", "A": "(He) God has said it, somewhere. Heb 4:4"},
{"Q": "Who said it, and where? They shall not enter my rest.", "A": "(He) God said it, in this passage. Heb 4:5"},
{"Q": "Who said it, through whom, and when? Today, if you hear his voice, do not harden your hearts.", "A": "(He) God said it, through David so long afterward. Heb 4:7"},
{"Q": "To whom was it said? You are my Son, today I have begotten you.", "A": "Christ. Heb 5:5"},
{"Q": "Who says it, to whom, and where? You are a priest forever, in the order of Melchizedek.", "A": "(He) God says it, to Christ, in another place. Heb 5:6"},
{"Q": "Who said it, to whom, when, and how? Surely I will bless you and multiply you.", "A": "When God made a promise to Abraham; he swore by himself, saying it. Heb 6:13-14"},
{"Q": "Who said it, to whom, and how? The Lord has sworn and will not change his mind: `You are a priest forever.'", "A": "(The one) God said it, to (him) Jesus (our Lord, another priest like Melchizedek), with an oath. Heb 7:21"},
{"Q": "Who said it? Behold, the days are coming when I will establish a new covenant with the house of Israel and with the house of Judah.", "A": "The Lord. Heb 8:8"},
{"Q": "Who will not say it, to whom? Know the Lord.", "A": "(They) The house of Israel shall not teach, each one his neighbor and each one his brother, saying it. Heb 8:11"},
{"Q": "Who said it, to whom, and when? This is the blood of the covenant that God commanded for you.", "A": "Moses said it, to all the people, when every commandment of the law had been declared by Moses to all the people. Heb 9:20"},
{"Q": "Who said it, and when? Sacrifices and offerings you have not desired, but a body have you prepared for me.", "A": "When Christ came into the world, he said it. Heb 10:5"},
{"Q": "Who said it, and when? Behold, I have come to do your will, O God, as it is written of me in the scroll of the book.", "A": "(I) Christ said it, (then) when Christ came into the world. Heb 10:7"},
{"Q": "Who said it? You have neither desired nor taken pleasure in sacrifices and offerings and burnt offerings and sin offerings.", "A": "(He) Christ. Heb 10:8"},
{"Q": "Who says it, to whom? This is the covenant that I will make with them after those days, declares the Lord.", "A": "The Holy Spirit also bears witness to us. Heb 10:15"},
{"Q": "Who says it, to whom? I will remember their sins and their lawless deeds no more.", "A": "The Holy Spirit says, to us. Heb 10:17"},
{"Q": "Who said it? Vengeance is mine; I will repay.", "A": "We know him who said it-- God. Heb 10:30"},
{"Q": "Who said it? The Lord will judge his people.", "A": "We know him who said it-- God. Heb 10:30"},
{"Q": "Of whom was it said? Through Isaac shall your offspring be named.", "A": "His [Abraham's] only son [Isaac]. Heb 11:18"},
{"Q": "To whom is it said, and how? My son, do not regard lightly the discipline of the Lord, nor be weary when reproved by him. For the Lord disciplines the one he loves, and chastises every son whom he receives.", "A": "The exhortation addresses you as sons. Heb 12:5-6"},
{"Q": "What said it? If even a beast touches the mountain, it shall be stoned.", "A": "A voice. Heb 12:19"},
{"Q": "Who said it, and why? I tremble with fear.", "A": "Moses said it, so terrifying was the sight. Heb 12:21"},
{"Q": "Who has said it, when, and how? Once more I will shake not only the earth but also the heavens.", "A": "Now (He) God has promised. Heb 12:26"},
{"Q": "Who has said it, and what is the response? I will never leave you nor forsake you.", "A": "(He) God has said it; so we can confidently say, 'The Lord is my helper; I will not fear; what can man do to me?' Heb 13:5"},
{"Q": "Who say it, how, and in response to what? The Lord is my helper; I will not fear; what can man do to me?", "A": "We can say it, with confidence, in response to what God has said: 'I will never leave you nor forsake you.' Heb 13:5"},
{"Q": "Who said it, about whom? This is my beloved Son, with whom I am well pleased.", "A": "The voice was borne to (him) our Lord Jesus Christ by the Majestic Glory (God the Father). 2Pe 1:17"},
{"Q": "Who will say it, when, and how? Where is the promise of his coming? For ever since the fathers fell asleep, all things are continuing as they were from the beginning of creation.", "A": "Scoffers will come in the last days with scoffing. They will say it. 2Pe 3:3"},
{"Q": "Who said it, to whom, and when? See that you make everything according to the pattern that was shown you on the mountain.", "A": "When Moses was about to erect the tent, he was instructed by God. Heb 8:5"},
{"Q": "Who said it, to whom? I will be to him a father, and he shall be to me a son.", "A": "God said it, not to angels, but to the Son [Jesus]. Heb 1:5"}
]